/**
  ******************************************************************************
  * 文件名          : UsartReceive.h
  * 创建时间        : 2019.01.16
  * 作者            : 陆伟建
  *-----------------------------------------------------------------------------
  * 最近修改时间    : 2019.02.11
  * 修改人          : 任云帆
  ******************************************************************************
  * 1.本代码基于STM32F427IIH6开发，编译环境为Keil 5，基于FreeRTOS进行开发。
  * 2.本代码只适用于Robocon 2019MR1机器人，不建议用于其他用途
  * 3.本代码以UTF-8格式编码，请勿以ANSI编码形式打开
  * 4.本代码包含大量中文注释，请仔细通读代码后使用
  * 5.本代码最终解释权归哈尔滨工业大学（深圳）南工问天战队所有
  *
  * Copyright (c) 2019 哈尔滨工业大学（深圳）南工问天战队 版权所有
  ******************************************************************************
  */

    /********************遥控接收系统规格参数*********************
    *DJI DESSET 2.4G遥控接收系统   工作频率           2.4GHz ISM *
    *                              通信距离(开阔室外)   1km      *
    *------------------------------------------------------------*
    *DT7遥控器                     特性                7通道     *
    *                              工作电流/电压       120mA@3.7V*
    *                              电池          3.7V2000mA锂电池*
    *------------------------------------------------------------*
    *DR16接收机                    特性          2.4GHz D-Bus协议*
    *                              接收灵敏度(1%PER)   -97dBm    *
    *                              工作电流/电压       145mA@5V  *
    *                              电源                4-8.4V    *
    *                              电压             41mm*29mm*5mm*
    *                              重量                 10g      *
    **************************************************************/

    /************************接收机DR16***************************
    *遥控器接收机输出信号为标准DBUS协议数据，当接收机和发射机建立*
    *连接后，接收机便会每隔7ms通过DBus发送一帧数据(18字节)       *
    *                                                            *
    *DBus通信参数如下:                                           *
    *                                                            *
    *DBus参数            数值                                    *
    *波特率             100Kbps                                  *
    *单元数据长度         8                                      *
    *奇偶校验位         偶校验                                   *
    *结束位               1                                      *
    *流控                 无                                     *
    **************************************************************/


    /*************************发射机DT7***************************
    *                                                            *						   
    *   -----------------------------------------------------    *
    *   |     (上-1)                               (上-1)   |    *
    *   |SW_L|(中-3)                          SW_R|(中-3)   |    *
    *   |     (下-2)                               (下-2)   |    *
    *   |                                                   |    *
    *   |                                                   |    *
    *   |    | ^ |                                | ^ |     |    *
    *   |    |   |左摇杆                    右摇杆|   |     |    *
    *   |    |   |                                |   |     |    *
    *   | ---     ---                          ---     ---  |    *
    *   |<           2>                       <           0>|    *
    *   | ---     ---                          ---     ---  |    *
    *   |    |   |                                |   |     |    *
    *   |    |   |                                |   |     |    *
    *   |    | 3 |                                | 1 |     |    *
    *   |                                                   |    *
    *   -----------------------------------------------------    *
    *                                                            *
    **************************遥控器信息**************************
    *域            通道0      通道1   通道2   通道3   S1     S2  *
    *偏移            0          11      22      33    44     46  *
    *长度(bit)      11          11      11      11     2      2  *
    *符号位         无          无      无      无    无     无  *
    *范围           ***********最大值1684*********    *最大值3*  *
    *               *          中间值1024        *    *最小值1*  *
    *               ***********最小值364**********               *
    *功能                                            1:上   1:上 *
    *                                                2:下   2:下 *
    *                                                3:中   3:中 *
    *                                                            *
    *************************************************************/
		
		

#ifndef _USARTRECEIVE_H_
#define _USARTRECEIVE_H_
#include "stm32f4xx.h"


#define CH0_BIAS 1024
#define CH1_BIAS 1024
#define CH2_BIAS 1024
#define CH3_BIAS 1024


typedef struct  
{
	double length;
	double vol[4];											//计算得到轮速
	double theta;												//机器人与场地坐标系夹角
	double V;														//目标速度的大小
	double angularVell;									//自传角速度
	double angle;												//目标速度与场地坐标系夹脚						
}MR1Commond;

typedef struct 
{
	int16_t ch0;
	int16_t ch1;
	int16_t ch2;
	int16_t ch3;
	int8_t left;
	int8_t right;
}Remote_s;



#define DEFAULTCOMMOND { L ,{0,0,0,0},0,0,0,0}


    //遥控器接收的原始数据
void MR1StateChange(void);
void RemoteReceiveHandle(void);
void GyroReceiveHandle(void);

#endif
